from app.keyboards.helpers import quick_reply, quick_inline
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton
from aiogram.utils.keyboard import InlineKeyboardBuilder


def main_menu_kb():
    return quick_reply(["📤 Подать объявление", "🔍 Посмотреть объявления", "💳 Подписка",
                                  "👤 Профиль", "❤️ Лайки"], row_width=2,
                                 first_single=True)

def profile_kb():
    return quick_reply([
        "💸 Пополнить баланс",
        "👥 Реферальная программа",
        "🎫 Ввести промокод",
        "🛠️ Тех поддержка",
        "📑 Правила",
        "⬅️ Назад"
    ], row_width=2, first_single=True)
def cancel_kb():
    return quick_reply(["❌ Отменить"])


def back_kb(back_to_profile: bool = False):

    if back_to_profile:
        kb = quick_reply(["⬅️ Назад в профиль"])
    else:
        kb = quick_reply(["⬅️ Назад"])

    return kb
def subscription_kb():
    return quick_reply([
        "💳 Купить подписку",
        "⬅️ Назад"
    ])

def pay_button(payment_data):
    payment_id = payment_data.get("payment_id")
    amount = payment_data.get("amount")
    payment_type = payment_data.get("payment_type")
    kb = [
        [InlineKeyboardButton(text=f"Оплатить {amount}₽", url=payment_data.get("payment_url"))],
        [InlineKeyboardButton(text="✅ Готово", callback_data=f"done_{payment_type}_{payment_id}")]
    ]

    return InlineKeyboardMarkup(inline_keyboard=kb)

def search_filters_kb():
    return quick_reply([
        "❤️",
        "⚙️ Фильтры",
        "👎",
        "🏠 Главное меню"
    ], row_width=3, first_single=False)




def liked_car_kb(advert_id: int, current_index: int, total_count: int):
    keyboard = []

    nav_buttons = []
    if current_index > 0:
        nav_buttons.append(InlineKeyboardButton(text="⬅️", callback_data=f"fav_prev_{advert_id}"))

    nav_buttons.append(InlineKeyboardButton(text=f"{current_index + 1}/{total_count}", callback_data="fav_counter"))

    if current_index < total_count - 1:
        nav_buttons.append(InlineKeyboardButton(text="➡️", callback_data=f"fav_next_{advert_id}"))

    if nav_buttons:
        keyboard.append(nav_buttons)

    keyboard.append([
        InlineKeyboardButton(text="🔍 Автотека", callback_data=f"fav_autoteka_{advert_id}")
    ])
    keyboard.append([
        InlineKeyboardButton(text="❌ Удалить", callback_data=f"fav_delete_{advert_id}")
    ])


    return InlineKeyboardMarkup(inline_keyboard=keyboard)

def now_liked_car_kb():
    kb = quick_reply(
        [
            "🔍 Отчёт автотеки",
            "⏩ Продолжить"
        ],
        row_width=1
    )
    return kb

def yes_no_kb():
    return quick_inline([
        ("✅ Да", "yes"),
        ("❌ Нет", "no")
    ])


def publish_kb(active_subscribe: bool):
    callback_data = "ad_publish" if active_subscribe else "ad_payment"
    return quick_inline([
        ("✅ Опубликовать", callback_data),
        ("✍️ Изменить", "ad_change")
    ])


def get_suggestions_inline_kb():
    builder = InlineKeyboardBuilder()
    builder.add(InlineKeyboardButton(
        text="Оставить моё",
        callback_data="keep_my_input"
    ))
    return builder.as_markup()


def get_filter_suggestions_inline_kb():
    builder = InlineKeyboardBuilder()
    builder.add(InlineKeyboardButton(
        text="Оставить моё",
        callback_data="filter_keep_my_input"
    ))
    return builder.as_markup()
def ad_change_kb():
    return quick_inline([
        ("Название", "change_name"),
        ("Год", "change_year"),
        ("Состояние", "change_condition"),
        ("Топливо", "change_fuel_type"),
        ("Кузов", "change_body_type"),
        ("Пробег", "change_mileage"),
        ("Цена", "change_price"),
        ("Двигатель", "change_engine"),
        ("КПП", "change_transmission"),
        ("Цвет", "change_color"),
        ("VIN", "change_vin"),
        ("🔍Автотека", "change_autoteka"),
        ("Гос номер", "change_license_plate"),
        ("Контакты", "change_contacts"),
        ("Описание", "change_description"),
        ("Фото", "change_photos"),
        ("⬅️ Назад", "change_back")
    ], row_width=2)

def color_kb():
    return quick_inline([
        ("⚪ Белый", "step_color_white"),
        ("⚫ Черный", "step_color_black"),
        ("🔘 Серый", "step_color_gray"),
        ("🔲 Серебристый", "step_color_silver"),
        ("🔴 Красный", "step_color_red"),
        ("🔵 Синий", "step_color_blue"),
        ("🟢 Зеленый", "step_color_green"),
        ("🟤 Коричневый", "step_color_brown"),
        ("🟡 Желтый", "step_color_yellow"),
        ("🟠 Оранжевый", "step_color_orange"),
        ("🟣 Фиолетовый", "step_color_purple"),
    ], row_width=3)


def condition_kb():
    return quick_inline([
        ("Отличное", "step_condition_perfect"),
        ("Хорошее", "step_condition_good"),
        ("Требует ремонта", "step_condition_bad")
    ], row_width=1)

def fuel_type_kb():
    return quick_inline([
        ("Бензин", "step_fuel_petrol"),
        ("Дизель", "step_fuel_diesel"),
        ("Газ", "step_fuel_gas")
    ], row_width=1)

def transmission_kb():
    return quick_inline([
        ("Механика", "step_transmission_manual"),
        ("Автомат", "step_transmission_auto"),
        ("Робот", "step_transmission_robot"),
        ("Вариатор", "step_transmission_cvt")
    ], row_width=1)

def body_type_kb():
    return quick_inline([
        ("Седан", "step_body_sedan"),
        ("Хэтчбек", "step_body_hatchback"),
        ("Универсал", "step_body_wagon"),
        ("Внедорожник", "step_body_suv"),
        ("Купе", "step_body_coupe"),
        ("Минивэн", "step_body_minivan"),
        ("Пикап", "step_body_pickup"),
        ("Кабриолет", "step_body_convertible")
    ], row_width=2)


def skip_photos_kb(photos_count: int):
    if photos_count > 0:
        buttons = [
            ("✅ Продолжить", "step_photos_process"),
        ]
    else:
        buttons = [
            ("⏩ Пропустить", "step_photos_skip")
        ]
    return quick_inline(buttons)

def autoteka_kb():
    return quick_inline([
        ("✅ Подключить Автотеку", "autoteka_yes"),
        ("❌ Без Автотеки", "autoteka_no")
    ], row_width=1)

def autoteka_buy_kb():
    return quick_inline([
        ("🛒 Купить отчет", "buy_autoteka"),
    ], row_width=1)

def _filters_menu_kb():
    return quick_reply(
        [
            "🏙 Город",
            "🔢 Год",
            "🚗 Марка и модель",
            "⭐ Состояние",
            "⛽ Топливо",
            "📏 Пробег",
            "💰 Цена",
            "⚙️ Объём двигателя",
            "🪛 КПП",
            "🚙 Кузов",
            "🎨 Цвет",
            "♻️ Сбросить фильтры",
            "⬅️ Назад к поиску",
        ],
        row_width=4,
        first_single=False,
    )

def back_from_filter_kb():
    return quick_reply([
        "⬅️ Отмена"
    ])


def rules_text():
    text = '''Пользовательское соглашение (TOS)

1.Общие положения
   Настоящее Пользовательское соглашение (далее — Соглашение) регулирует отношения между пользователем и владельцем бота по продаже автомобилей (далее — Администрация). Использование бота означает полное и безоговорочное принятие условий Соглашения, а также указывает на согласие с ознакомлением ими.[1][2]

2. Описание услуг  
   Бот (@fast_buy_car_bot) предоставляет услуги по поиску, консультации и сопровождению сделок по продаже автомобилей. Стоимость услуг определяется индивидуально для каждого клиента и зависит от вариации продажи, марки и модели автомобиля, а также от дополнительных пожеланий. Точная сумма указывается после согласования всех условий. Оплата услуг производится посредством банковских карт, СБП или других способов, поддерживаемых платёжной системой. Возврат средств возможен только в случае, если услуга не была оказана или оказана с существенными нарушениями.

3. Обязанности пользователя
   Пользователь обязуется предоставлять достоверную информацию о себе и своих требованиях к автомобилю. Запрещено использовать бота для незаконных целей, распространения ложной информации или мошенничества.

4. Ответственность сторон  
   Администрация не несёт ответственности за достоверность информации, предоставленной третьими лицами (продавцами автомобилей). Администрация оставляет за собой право отказать в оказании услуг без объяснения причины.

5. Конфиденциальность
   Персональные данные пользователей используются исключительно для выполнения заказа и не передаются третьим лицам, за исключением случаев, предусмотренных законодательством.

6. Запрещённые действия
   Пользователям запрещено:  
   - Предоставлять ложные сведения о себе или своих намерениях.
   - Использовать бота для целей, противоречащих законодательству РФ.  
   - Оскорблять, угрожать или вести агрессивное поведение по отношению к Администрации или другим пользователям.  
   - Пытаться взломать, получить несанкционированный доступ к системе или использовать автоматизированные инструменты (боты, скрипты) для получения услуг.  
   - Распространять вредоносное ПО, спам или рекламу через бота.

7. Контактная информация
   Для ознакомления и связи с Администрацией:  
   - Email: fastbuycarr@gmail.com  
   - Telegram: @car_sup

8. Информация об ИП
   Все услуги оказываются на основании деятельности индивидуального предпринимателя:  
   - ИП Долгашев Кирилл Александрович  
   - ИНН: 525821427126  
   - ОГРНИП: 325527500146508

9.Изменение условий
   Администрация оставляет за собой право вносить изменения в настоящее Соглашение. Пользователь обязан самостоятельно ознакомиться с актуальной версией Соглашения перед использованием бота (@fast_buy_car_bot).
'''
    return text
